app/views/students/show.html.erb

<ul>
  <% @student.plans.each do |plan| %>
---
SELECT "plans".* FROM "plans" WHERE "plans"."student_id" = $1  [["student_id", 1]]