app/views/professors/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."professor_id" = $1  [["professor_id", 1]]
---
<ul>
  <% @professor.student.each do |s| %>