app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("prefix", "name", "number", "section", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["prefix", "asdf"], ["name", "asdfasf"], ["number", 13], ["section", 0], ["created_at", "2021-04-08 14:32:47.357764"], ["updated_at", "2021-04-08 14:32:47.357764"]]

  def edit
    @course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @course = Course.find(params[:id])

    if @course.update(course_params)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "courses" SET "section" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["section", 11], ["updated_at", "2021-02-18 02:36:52.926118"], ["id", 1]]