app/controllers/plans_controller.rb

  def index
    @plans = Plan.all
---
SELECT "plans".* FROM "plans"

  def create
    @plan = Plan.new(plan_params)

    respond_to do |format|
      if @plan.save
---
INSERT INTO "plans" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-03-05 17:13:04.364040"], ["updated_at", "2021-03-05 17:13:04.364040"]]

  def destroy
    @plan.destroy
---
DELETE FROM "plans" WHERE "plans"."id" = $1  [["id", 3]]

    def set_plan
      @plan = Plan.find(params[:id])
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]