app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors"
---
  def index
    @professors = Professor.all

SELECT "professors".* FROM "professors" WHERE "professors"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def edit
    @professor = Professor.find(params[:id])

INSERT INTO "professors" ("Name", "CWID", "created_at", "updated_at", "programdirector_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["Name", "John Kreisler"], ["CWID", 534], ["created_at", "2021-04-20 20:56:17.691701"], ["updated_at", "2021-04-20 20:56:17.691701"], ["programdirector_id", 1243]]
---
  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save

DELETE FROM "professors" WHERE "professors"."id" = $1  [["id", 4]]
---
  def destroy
    @professor.destroy

SELECT "professors".* FROM "professors" WHERE "professors"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_professor
      @professor = Professor.find(params[:id])